<template>
  <view class="template-content">
    <!-- 顶部自定义导航 -->
    <tn-nav-bar fixed alpha customBack>
      <view slot="back" class='tn-custom-nav-bar__back'
        @click="goBack">
        <text class='icon tn-icon-left'></text>
        <text class='icon tn-icon-home-capsule-fill'></text>
      </view>
    </tn-nav-bar>



    <view class="tn-margin tn-text-center" :style="{paddingTop: vuex_custom_bar_height + 'px'}">
      <view class="tn-text-center tn-margin-bottom-lg tn-text-bold">
      	隐私政策
      </view>
	  尊敬的 辰雪博客 用户（以下统称“您”），为了便于您使用 辰雪博客（包括辰雪博客网页端（cxblog.zhaohaoyue.love）、移动应用（“梦辰雪”APP）、辰雪博客小程序和相关的服务渠道，以下简称“本平台”） 本平台会按照《全国人力资源社会保障政务服务平台用户隐私政策》(以下简称“本政策”)来约定，您使用本平台的产品和服务时，本平台如何收集、使用、存储和对外提供您的个人信息。本政策适用于您通过任何方式对本平台的访问和使用。

      您在使用本平台的产品或服务时，本平台需要按照《中华人民共和国民法典》、《中华人民共和国网络安全法》等国家法律法规的相关要求收集、存储、使用、共享您的信息，以及向您提供服务及提升服务质量。本平台希望通过本政策向您说明：在您使用本平台的产品或服务时，本平台会收集哪些数据、为什么收集这些数据、会利用这些数据做什么以及本平台如何保护这些数据。本政策与您所使用的本平台的产品或服务息息相关，对于您行使用户权利及保护您的个人信息至关重要，请您在使用本平台的产品或服务前认真阅读并充分理解本政策所写明的内容。

      请您仔细阅读本政策，并确定理解本平台对您的信息的处理规则。如您点击“同意”并确认提交、使用本平台，即视为您同意本政策(含更新版本)内容，并且同意本平台按照本政策收集、使用、保存和对外提供您的个人信息。

      本政策适用于使用本平台的所有用户，无论您是通过移动终端或其他设备获得的平台服务。在平台更新本政策后，您继续使用本平台的产品与/或服务，即意味着您同意本政策 (含更新版本)内容，并且同意平台按照本政策 (含更新版本)收集、使用、保存和对外提供您的相关信息。

      请您注意本政策中加粗部分的个人信息均为您的敏感信息，加粗部分系统权限为敏感权限，请您在提供以上信息或对以上权限进行授权前谨慎考虑。
      一、【如何收集与使用您的个人信息】
      个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。

      在您使用本平台提供的各项业务、产品、服务等功能的过程中，本平台需要收集您的一些信息，用以向您提供服务、提升我们的服务质量、保障您的信息安全以及符合国家法律法规及监管规定。

      （一）责任说明
      本平台负责收集、管理及维护用户真实信息，以及您在本平台产生的行为信息；根据业务需求收集您的业务必填信息；根据业务需要，第三方服务系统会共享您的个人信息或进行二次认证。本平台将按现有技术提供相应的安全措施来保护信息不丢失、泄漏，不被滥用和变造。如个人信息或业务信息发生泄漏，与本平台所有方无关。

      （二）信息的收集
      为保障您使用本平台过程的安全性，改善您的使用体验，本平台会收集、使用和保存下列与您有关的个人信息。如果您不提供相关信息，您将无法享受本平台提供的以下对应服务：

      1.当您登录本平台时，您需要向本平台授权获取或主动输入您的手机号码/身份证号+登录密码；若您登录法人账号时，您需要向本平台提供登录法人账户的法定代表人/经办人/管理员用户名+登录密码，同时同意本平台对您提供的登录信息进行有效性核验。如您不提供上述信息，本平台将无法向您提供实名认证、网上办事等需登录才可使用的服务。

      2.当您重置本平台登录密码时，您需要向本平台授权获取或主动输入您的用户名、手机号码、短信验证码信息，同时同意本平台对您提供的有关信息进行有效性核验。

      3.当您使用人脸识别功能时，需要您授权本平台移动端使用您的相机权限，您同意本平台将您向本平台提供的人像信息与法律法规允许的机构或政府机关授权的机构进行对比核验，确认当前登录的账号是否是您本人正在操作。如果您不使用人脸识别功能，则无需提供相关信息。

      4.当您使用实名认证功能时，本平台会收集您的真实姓名、证件号码、手机号码、面部图像（视频）信息。您需要向本平台授权获取或您按照页面提示文字主动输入以上全部或部分信息，同时授权本平台访问您的相机。您同意本平台将您向本平台提供的姓名和证件号码与法律法规允许的机构或政府机关授权的机构进行对比核验。如果您不使用实名认证功能，则无需提供相关信息。

      5.当您使用部分服务或功能时，平台会收集您的地理位置信息，您需要向本平台授权获取或您按页面提示文字主动输入以上全部或部分信息。您同意本平台将您向本平台提供的信息与法律法规允许的机构或政府机关授权的机构进行对比校验。如果您不使用有关服务，则无需提供相关信息。

      6.当本平台产生报错信息时，本平台所集成的腾讯bugly将进行收集报错信息并反馈。腾讯bugly并不收集您的个人信息或使用您的个人信息。

      7.如本平台在使用您的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，本平台将在使用您的个人信息前，再次向您告知并征得您的明示同意。

      8.当您在使用本平台提供的服务时，如需输入其他自然人的信息，请确保您已就上述信息的使用获得了相关权利人的授权。

      9.使用百度统计SDK服务：统计分析/收集个人信息类型：设备信息（IMEI/MAC/Android ID/IDFA/OpenUDID/GUID/SIM 卡 IMSI信息等），百度统计隐私权政策链接：https://tongji.baidu.com/web/help/article?id=330&type=0

      10.产品集成百度推送SDK及推送通道SDK（如小米、华为），推送通道SDK需要收集采集设备标识符（IMEI/MAC/AndroidID/IDFA/OpenUDID/GUID/SIM 卡 IMSI 信息等），用于唯一标识设备，以便向用户设备推送消息。采集地理位置甄别推送通道，提高消息推送的区域覆盖率。

      （三）信息的使用
      1.在本平台向您提供政务服务、便民服务期间，您同意授权本平台持续收集您的信息。在符合相关法律法规的前提下，本平台可能将收集的信息用作以下用途：

      （1）向您提供服务（如实名认证信息、用来接受验证码的手机号码，是继续获得服务的前提）。

      （2）满足您的个性化需求。例如，语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户做出其他方面的回应。

      （3）服务优化和开发。例如，本平台会根据本平台响应您的需求时产生的信息，优化本平台的服务，但这些信息不会包含您的任何身份识别信息。

      （4）保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或本平台相关协议、规则的情况，本平台可能使用您的账号信息、并整合设备信息、有关网络日志以及有关政府机构、合作伙伴分享的信息，来判断您账号风险、进行身份验证、安全事件的检测及防范，并依法采取必要的记录、审计、分析、处置措施。例如，本平台会将您的信息用于身份验证、安全防范、投诉处理、纠纷协调、诈骗监测等用途。

      （5）向您提供与您更加相关的服务。例如，向您提供您可能感兴趣的类似功能或服务等。

      2.您授权同意的以及法律法规规定的其它用途。

      二、【本平台如何使用Cookie和同类技术】
      本平台可能会通过Cookies（储存在用户本地终端上的数据）和其他相关技术收集和使用您的信息。本平台使用Cookies的具体用途包括：

      1.记住您的身份。例如：Cookies有助于本平台辨认您作为本平台的注册用户的身份。

      2.分析您使用本平台服务的情况，以便为您提供更加周到的个性化服务，包括定制化页面、推荐等服务。

      3.您可以通过浏览器等设置拒绝或管理Cookies。但请注意，如果停用Cookies，您有可能无法享受最佳的服务体验，某些功能可能会受到影响。

      三、【本平台如何对外提供您的个人信息】
      （一）共享

      本平台承诺将对您的信息进行严格保密。除法律、法规及监管部门另有规定外，本平台不会与本平台以外的公司、组织和个人共享您的个人信息，但由于很多服务由第三方系统提供，因业务流转处理存在三方业务系统之间需要共享您的信息情况，但会遵循以下原则：

      1.在获取明确同意的情况下共享：获得您的明确同意后，本平台会与其他方共享您的个人信息。

      2.在法定情形下的共享：本平台可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。

      3.为了促成办理服务或协助解决争议，某些情况下只有共享您的个人信息，才能促成办理或处理您与他人的纠纷或争议。

      4.与本平台合作的第三方服务方共享：为便于本平台向您提供服务，您的个人信息可能会在本平台与本平台合作的第三方服务方共享。本平台只会共享姓名、证件类型、证件号码及其他使用本平台合作的第三方服务方的产品或服务所必要的个人信息，如果本平台共享您的除上述必要个人信息以外的其他个人信息，或本平台合作的第三方服务方改变个人信息的使用及处理目的，本平台将再次征求您的明示同意。

      5.本平台可能会向移动运营商提供您的部分账号信息，以便及时向您的移动设备发送消息或服务通知。

      （二）转让

      本平台不会将您的个人信息转让给任何公司、组织机构和个人。但以下情况除外：

      1.事先获得您的授权或同意。

      2.根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供。

      （三）公开披露

      本平台仅会在以下情况下，公开披露您的个人信息：

      1.获得您明确同意或基于您的主动选择；

      2.如果本平台确定您出现违反法律法规或严重违反本平台相关协议规则的情况，或为保护本平台或公众的人身财产安全免遭侵害，本平台可能依据法律法规，遵守法院判决、裁定或其他法律程序的规定，遵守相关政府机关或其他有权机关的要求或本平台相关协议规则公开披露您的个人信息，包括相关违规行为以及本平台已对您采取的措施。

      3.根据国家政策安排或法律规定，本平台以及有关政府机构有可能进行组织架构调整、资产调配、转让或类似的交易，您的信息有可能作为其中一部分而被转移。本平台将遵守相关法律法规的要求，在转移前通知您，确保信息在转移时的机密性，以及变更后继续履行相应责任和义务。

      （四）共享、转让、公开披露个人信息时事先征得授权同意的例外

      以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：

      1.与国家安全、国防安全有关的；

      2.与公共安全、公共卫生、重大公共利益有关的；

      3.与犯罪侦查、起诉、审判和判决执行等有关的；

      4.出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；

      5.您自行向社会公众公开的个人信息；

      6.从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；

      7.与本平台履行法律法规规定以及行业主管部门规定的义务相关的其他情形。

      8.符合其他国家要求的。

      四、【本平台如何保存您的个人信息】
      本平台在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内（不包含香港、澳门、台湾地区）。本平台仅在本政策所述目的所必需期间和法律法规规定的时限内保存您的个人信息，超出保存期限后，本平台将对所收集的信息进行匿名化处理。

      您在使用本平台服务期间，本平台将持续为您保存您的个人信息。在您注销本平台账号后，本平台仅在法律法规规定的期限内，以及为实现本政策声明的目的所必须的时限内保留您的个人信息。超出上述个人信息保存期限后，本平台会对您的个人信息进行删除或匿名化处理。

      在下列情况下，且仅出于下列情况相关的目的，本平台有可能需要较长时间保留您的信息或部分信息：

      1.遵守适用的法律法规等有关规定。

      2.遵守法院判決、裁定或其他法律程序的要求。

      3.遵守相关政府机关或其他有权机关的要求。

      4.我们有理由确信需遵守法律法规等有关规定。

      5.为执行相关服务协议或本隐私政策、维护社会公共利益、处理投诉或纠纷，保护群众人身和财产安全或合法权益所合理必需的用途。

      五、【您如何管理您的个人信息】
      （一）查看及修改您的个人信息

      1.您登录本平台后，可以在“我的-个人账号信息”中，查看您的个人信息资料、预留身份信息，查看或重置登录密码。

      2.更正或补充您的个人信息：当您发现本平台处理的关于您的个人信息有错误时，您有权要求本平台做出更正或补充。

      （二）改变您授权同意的范围或撤回您的授权

      您可以通过注销账号的方式撤回全部隐私授权，本平台将不会再收集、使用或对外提供与该账号相关的个人信息，但您在使用本平台服务期间提供或产生的信息，本平台仍需按照相关要求的时间进行匿名化保存，且在该依法保存的时间内有权机关仍有权依法查询。

      当您撤回同意或授权后，本平台无法继续为您提供撤回同意或授权所对应的便民服务。但您撤回同意或授权的决定，不会影响此前本平台基于您的授权而开展的使用、存储和对外提供您个人信息的处理。

      （三）注销用户管理

      您可以在“我的-个人账号信息”里注销账号。在注销账号之后，本平台及其他基于本平台统一身份认证的应用系统也将停止为您提供服务，并依据您的要求删除您的个人信息，法律法规另有规定的除外。

      在以下情形中，您可以向本平台提出删除个人信息的请求：

      1.如果本平台处理个人信息的行为违反法律法规；

      2.如果本平台收集、使用您的个人信息，却未征得您的同意；

      3.如果本平台处理个人信息的行为违反了与您的约定；

      4.如果您不再使用本平台的产品或服务，或您注销了账号；

      5.如果本平台不再为您提供产品或服务。

      当您从本平台的服务中删除信息后，本平台可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。

      （四）在访问、修改、删除、注销账号的相关信息时，本平台可能会要求您进行身份验证并审核合法性，以保障账号安全。请您理解，由于技术所限、基于法律法规要求，您的某些请求可能无法进行响应。基于法律法规要求、保障信息安全等正当事由，您的部分信息可能无法访问、修改和删除。

      （五）响应您的上述请求

      为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。本平台可能会先要求您验证自己的身份，然后再处理您的请求。请您理解，对于某些无端重复、需要过多技术手段、给他人合法权益带来风险或者非常不切实际的请求，本平台可能会予以拒绝。

      尽管有上述约定，但按照法律法规要求，如涉及以下情形本平台将可能无法响应您的请求：

      1.与国家安全、国防安全相关的；

      2.与公共安全、公共卫生、重大公共利益相关的；

      3.与犯罪侦查、起诉、审判和判决执行等相关的；

      4.有充分证据表明您存在主观恶意或滥用权利的；

      5.响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；

      6.涉及商业秘密的。

      六、【征得授权同意的例外】
      根据相关法律法规规定，以下情形中，本平台可能会收集、使用您的相关个人信息而无需另行征求您的授权同意：

      1.与国家安全、国防安全直接相关的；

      2.与公共安全、公共卫生、重大公共利益直接相关的；

      3.与犯罪侦查、起诉、审判和判决执行等直接相关的；

      4.出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；

      5.收集的个人信息是您自行向社会公众公开的；

      6.合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；

      7.根据您要求签订和履行合同所必需的；

      8.对于维护本平台所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障、欺诈或被盗用等；

      9.法律法规规定及行业主管部门有关规定的义务相关的；

      10.本平台或接入的第三方服务为政府机构或具有法律赋予的行政权力机构，因执行公权利而进行收集、使用用户数据的行为。

      七、【本平台如何保护您的个人信息】
      本平台将努力为个人信息安全提供保障，以防止信息的丢失、不当使用、未经授权访问或公开披露。

      （一）为了保障您的信息安全，本平台将在法律法规相关规定要求和现有技术水平下使用符合业界标准的安全保护措施保护您提供的个人信息，采取物理、技术和行政管理安全措施降低丢失、误用、非授权访问、披露和更改的风险，尽力防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。

      （二）本平台建立专门的管理制度、流程和组织以保障信息的安全，严格限制访问信息的人员范围，对可能接触您的信息的工作人员采取最小授权原则，要求他们遵守保密义务。

      （三）如果本平台提供的全部或部分政务服务、便民服务停止使用，本平台将通过消息通知、弹框等形式向您进行告知，同时停止相关服务对您个人信息的收集等操作，保护您的个人信息安全。如因技术故障、网络攻击、自然灾害及事故、人为因素等各种原因造成全部或部分政务服务、便民服务无法使用，本平台将采取应急处置和恢复措施予以应对，尽快恢复服务。

      （四）互联网环境并非百分之百安全，本平台将尽力确保您的个人信息安全性。如果本平台的物理、技术、或管理防护设施遭到破坏，导致发生信息被非授权访问、公开披露、篡改、或毁坏及其它个人信息泄露安全事件，本平台会启动应急预案，阻止安全事件扩大，并以消息通知等形式将相关情况告知您。同时，本平台还将按照相关要求，上报个人信息安全事件的处置情况。

      （五）您在使用本平台服务时，本平台会通过您的手机号码、姓名、身份证号或者其他身份验证信息来识别您的身份，请您务必妥善保管上述信息。一旦您泄露了上述信息，您的账号信息可能因此泄露，并可能使您的资金安全等个人权益遭受损失。

      （六）本平台会采取一切合理可行的措施，确保未收集与您所办理业务无关的个人信息。

      八、【本平台如何保护未成年人信息】
      1.本平台主要面向成年人提供服务，本平台期望父母或监护人指导未成年人使用本平台的服务。本平台将根据国家相关法律法规的规定保护未成年人的信息的保密性及安全性。

      2.如您为未成年人，请您的父母或监护人仔细阅读本政策，并在征得您的父母或监护人同意的前提下使用本平台的服务或向本平台提供信息。如您的监护人不同意您按照本政策使用本平台的服务或向本平台提供信息，请您立即终止使用本平台的服务并及时通知本平台，以便本平台采取相应的措施。

      3.对于经父母或法定监护人同意而收集未成年人个人信息的情况，本平台只会在受到法律允许、父母或法定监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。如果父母或监护人发现本平台在未获父母或监护人同意的情况下收集了未成年人的个人信息，请通过官方服务邮箱反馈联系本平台，本平台会设法尽快删除相关数据。

      4.未成年人的实名认证信息受实名认证管理机构管理，基于管理机构风险控制的考虑，未成年人的实名认证可能存在无法通过的情况，在此情况下，本平台将无法提供相应服务。

      九、【您的个人信息如何转移】
      本平台在中华人民共和国境内收集的个人信息，将存储在中华人民共和国境内。本平台仅在本政策所述目的所必需期间和法律法规规定的时限内保留您的个人信息。如果需要将您的个人信息转移到境外，本平台将：

      1.另行获得您的授权同意，并履行法定程序，进行安全评估，在符合届时适用法律的情形下使您的个人信息得到足够的保护；

      2.该等转移将在符合届时适用法律要求的前提下进行，即便获得您的授权但是转移方式或者目的不符合相关法律法规规定的，本平台也不会进行转移。

      十、【本政策如何更新】
      在相关法律法规发生变化或本平台服务发生变动等必要情形下，本平台将本政策做出修改，并取代此前相关内容。您如不同意新的修改内容，请及时与本平台联系或立即停止使用本政策约定的服务；如您选择同意并继续使用相关服务，则视为您完全同意并接受新的修改内容。如客观情况及经营方针变化导致本平台需要中断或停止相关服务的，本平台将及时进行通知，请您对此表示理解和认同。

      十一、【其它】
      （一）本政策的成立、生效、履行、解释及纠纷解决，适用中华人民共和国法律、行政法规和规范性文件。

      （二）本政策无论因何种原因部分无效或不可执行，都不影响本政策其它部分。

      （三）本政策中未尽事宜，按照法律法规和本平台相关业务规则及国内通行的惯例办理。

      （四）因本政策内容或执行发生任何争议，当事各方应协商解决；协商不成时，应向全国人力资源社会保障政务服务平台运营方所在地人民法院提起诉讼解决。

      十二、【如何联系我们】
      如果您对本政策有任何疑问、意见或建议，可通过以下方式与我们联系：

      客服热线：18333191029
    </view>
  </view>
</template>

<script>
  import page_mixin from '@/libs/mixin/page_mixin.js'
  export default {
    name: 'TemplateContent',
    mixins: [page_mixin],
    data(){
      return {}
    },
    methods: {

    }
  }
</script>

<style lang="scss" scoped>
  /* 胶囊*/
  .tn-custom-nav-bar__back {
    width: 100%;
    height: 100%;
    position: relative;
    display: flex;
    justify-content: space-evenly;
    align-items: center;
    box-sizing: border-box;
    background-color: rgba(0, 0, 0, 0.15);
    border-radius: 1000rpx;
    border: 1rpx solid rgba(255, 255, 255, 0.5);
    color: #FFFFFF;
    font-size: 18px;

    .icon {
      display: block;
      flex: 1;
      margin: auto;
      text-align: center;
    }

    &:before {
      content: " ";
      width: 1rpx;
      height: 110%;
      position: absolute;
      top: 22.5%;
      left: 0;
      right: 0;
      margin: auto;
      transform: scale(0.5);
      transform-origin: 0 0;
      pointer-events: none;
      box-sizing: border-box;
      opacity: 0.7;
      background-color: #FFFFFF;
    }
  }
</style>
